c5/src/Documents/Permission/Permission.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Permission</name>
  <posting>Deny</posting>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Document</name>
    <type>
      <types>DocumentRef.Invoice</types>
      <types>DocumentRef.InvoiceRecord</types>
    </type>
  </attributes>
  <attributes>
    <name>Expired</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Resolution</name>
    <type>
      <types>EnumRef.AllowDeny</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Restrictions</name>
    <attributes>
      <name>Reason</name>
      <type>
        <types>EnumRef.RestrictionReasons</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Enums/AllowDeny/AllowDeny.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AllowDeny</name>
  <enumValues>
    <name>Allow</name>
  </enumValues>
  <enumValues>
    <name>Deny</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/Permission/ObjectModule.bsl
Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	checkExpiration ( CheckedAttributes );

EndProcedure

Procedure checkExpiration ( CheckedAttributes )
	
	if ( Resolution = Enums.AllowDeny.Allow ) then
		CheckedAttributes.Add ( "Expired" );
	endif;

EndProcedure

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	if ( DataExchange.Load ) then
		return;
	endif;
	if ( DeletionMark ) then
		reset ();
	endif;

EndProcedure

Procedure reset ()
	
	Customer = undefined;
	Document = undefined;
	Responsible = undefined;
	Resolution = undefined;
	Restrictions.Clear ();

EndProcedure
